{"name":"WA_TMF","intents":[{"intent":"Telco_International_Rate_Plan_Inquiry","examples":[{"text":"Why do I pay such high prices for calls to the uk?"},{"text":"Calls abroad"},{"text":"Can family members overseas call me internationally on my phone?"},{"text":"Can I call to Canada for free?"},{"text":"Can you tell me the current rate of charges from Europe mainland to uk from my phone?"},{"text":"Could you please tell me how much it would cost me to phone to france?"},{"text":"Does my plan include international calling?"},{"text":"Do you offer international service?"},{"text":"Hello. I've never made an international call on my phone and would like to know about what happens if I do?"},{"text":"How much do calls to the U.K. cost?"},{"text":"International plans"},{"text":"Internation calling"},{"text":"Is there a plan in which I can make calls to India for free? or at a cheap rate?"},{"text":"I want to make a call to Germany"},{"text":"What are the charges for calling outside US?"},{"text":"What are the international rates from my home country?"},{"text":"What international plans do you carry?"},{"text":"What is the best international rate plan?"},{"text":"What is the price of phone calls internationally? during what times are they for free?"},{"text":"What's the off peak cost to call london?"}],"description":"Inquire about international plans."},{"intent":"eCommerce_Product_Order_Status","examples":[{"text":"Can I check on my order?"},{"text":"Can you track the whereabouts of this sim I ordered?"},{"text":"Expected to ship"},{"text":"Has my new phone shipped yet?"},{"text":"Has the order been dispatched yet?"},{"text":"How do I track my shipment?"},{"text":"How soon can we expect the new shipment of iphone 6 plus for those who have pre-orders since last week?"},{"text":"Yes I want to track my order"},{"text":"Yes it was attempted for delivery but it says the parcel was refused though we were in the flat"},{"text":"Where is my order?"},{"text":"When is my new phone supposed to arrive?"},{"text":"What state you are in with my current order?"},{"text":"Tracking number"},{"text":"Shipping status"},{"text":"Please, can you tell me about the status of an orden I made?"},{"text":"Order progress"},{"text":"I would like to check the status of an order I placed recently."},{"text":"I was just wondering if I could check the status of an order I made."},{"text":"I want a status report on an order I made last week."},{"text":"I purchased an item the other day and still haven't received an update about it, have you shipped it yet?"}],"description":"Request status of an order that has been placed."},{"intent":"Telco_Activate_Roaming","examples":[{"text":"How do I begin roaming?"},{"text":"Turn on the roaming function."},{"text":"Turn on roaming abroad"},{"text":"This phone works abroad?"},{"text":"Set up roaming"},{"text":"Please add international roaming to my account"},{"text":"Phone travelling on"},{"text":"I would like to add roaming to my account"},{"text":"I wanna initiate roaming"},{"text":"I m travelling abroad to venice with work and I want to activate roaming"},{"text":"I'm going on vacation next week overseas. is there anything I need to update to keep being able to use this service while I'm there?"},{"text":"I already have a sim I want to add international roaming service"},{"text":"How can I use the roaming service?"},{"text":"How can I start using my phone abroad?"},{"text":"Hello activate roaming"},{"text":"Great ok by the way I need to activate international roaming"},{"text":"Can I use my phone while traveling?"},{"text":"Can I start roaming service?"},{"text":"Can I add roaming to my plan?"},{"text":"Activate phone outside us"}],"description":"Activate international roaming."},{"intent":"Telco_Price_Plan_Inquiry","examples":[{"text":"How does my plan compare with the rest of the industry?"},{"text":"Do I get free calls?"},{"text":"Does the samsung galaxy appeal require a data plan?"},{"text":"Could you tell me the prices of the different packages?"},{"text":"Can you please provide me with info on the different plans that are available?"},{"text":"Are my weekend calls free?"},{"text":"Why is this the best tariff?"},{"text":"I need to know if there is any new promotions on my rate plan"},{"text":"I would like to know more about the services you offer"},{"text":"Show some plan"},{"text":"What are the current plans for multiple lines?"},{"text":"What are the data limits in your mobile subscribtion?"},{"text":"What are the latest offers for talk time?"},{"text":"What carrier service do you offer?"},{"text":"What data rates are available for my internet service and what are the charges?"},{"text":"What family or group share plans are available what is the service term?"},{"text":"What is the best internet offer package?"},{"text":"What offer am I on?"},{"text":"What type of deals to you have for a family of 6?"},{"text":"Which plan is the least expensive for my historic data usage?"}],"description":"Inquire about the price plan subscribed to."},{"intent":"eCommerce_Past_Payment_Inquiry","examples":[{"text":"I already pay that in this month"},{"text":"How do I review my payments?"},{"text":"How can I know my payment went through?"},{"text":"Have I paid my bill?"},{"text":"Does the payment for july is already done?"},{"text":"Can you tell me if I paid my bill with my credit card?"},{"text":"Can I get a payment record for these whole year?"},{"text":"When was this specific payment made?"},{"text":"What is the confirmation number for the payment I made on july 4, 2016?"},{"text":"Wanted to make sure my payment was received."},{"text":"Verify payment"},{"text":"Past payment"},{"text":"My bill says I didn't make a payment last month, but I did, can you look into this please?"},{"text":"I want to make sure that a payment was credited to my account. can you verify that?"},{"text":"I want payment information by a device two months ago"},{"text":"I paid my bill but got sent an overdue notice, my bank statement shows it went through so why does it say its overdue?"},{"text":"I need some details about my last month payment."},{"text":"Indicate payment for the purchase of my device six months ago"},{"text":"I'd like to check the status of a bill I paid as it has not been credited to my account."},{"text":"I can't find my payment"}],"description":"Inquire about payments made in the past."},{"intent":"Telco_Deactivate_Roaming","examples":[{"text":"Could you show me how to turn off data roaming?"},{"text":"What can I do to stop roaming?"},{"text":"Turn off phone travelling"},{"text":"Turn off mobile searching."},{"text":"Stop the connection in other areas"},{"text":"Stop service on phone when outside the u.s."},{"text":"Stop prepaid phone from roaming."},{"text":"Quit roaming"},{"text":"Need to keep the roaming feature turned off."},{"text":"I want to turn off the roaming function."},{"text":"I want to stop the roaming"},{"text":"I want to shut down my phone outside of the us."},{"text":"I don't want to use my phone while traveling"},{"text":"I don't want to have connection in another country"},{"text":"How do I turn off data roaming on my phone?"},{"text":"How do I shut down my phone from searching?"},{"text":"Help with deactivating roaming"},{"text":"Disable my cell phone outside the united states"},{"text":"Deactivate roaming on my number"},{"text":"Deactivate roaming abroad"}],"description":"Deactivate international roaming."},{"intent":"Telco_Activate_Device","examples":[{"text":"My sim hasn't been activated yet and it's been weeks"},{"text":"Just want my phone on"},{"text":"I would like to activate my new device please"},{"text":"I want to activate my sim"},{"text":"I want my iphone up"},{"text":"I am calling to activate my new phone"},{"text":"How to activate a 4g device?"},{"text":"How do I go about activating my phone?"},{"text":"Hi I'd like to activate my sim and I've had a lot of problems with this previously"},{"text":"Hello, I have a new device and pay monthly sim with you through carphone warehouse and it's been 24 hours and the sim is still not working and carphone are saying everything is activated on there end"},{"text":"Would you mind activating my device?"},{"text":"Authorize chip sim card"},{"text":"Can I activate my new phone please?"},{"text":"Simcard activation"},{"text":"Could you activate a sim?"},{"text":"Sim set up"},{"text":"To get the phone activated"},{"text":"What is the toll free number to activate a sim?"},{"text":"When will my sim be activated as I still cant make calls?"},{"text":"Why isn't my new number activated yet?"}],"description":"Activate a device."},{"intent":"Telco_Recharge_SIM","examples":[{"text":"What needs to be done to fill the prem?"},{"text":"Adding minutes"},{"text":"Add money to prepaid"},{"text":"Can you tell me how can I add minutes to my prepaid phone?"},{"text":"Could you help me to add minutes to my pre paid?"},{"text":"Credit running out"},{"text":"How can I quickly recharge?"},{"text":"How can I top up my device?"},{"text":"How to top up to sim?"},{"text":"I need credit on my prepaid phone"},{"text":"I need to add some credit to my pre paid"},{"text":"I need your help to put money in my pre paid"},{"text":"I wanna add minutes"},{"text":"I want to topup prepay"},{"text":"I would like to recharge my prepaid service"},{"text":"Please increase my balance in my pay as you go phone?"},{"text":"Please recharge my sim"},{"text":"Recharge pre-paid plan"},{"text":"What is the procedure to initiate a recharge?"},{"text":"What should I do and I pay to fill pre-paid sim?"}],"description":"Add value to a prepaid plan or SIM card."},{"intent":"Telco_Troubleshooting","examples":[{"text":"Why no display in the dashboard?"},{"text":"I have a tablet that's continually rebooting, how do I resolve this?"},{"text":"I cannot send messages of voice"},{"text":"I am calling about support on a mobile data card"},{"text":"How can I get my wifi working again?"},{"text":"Hi my device isn't working"},{"text":"Hi I updated my apps yesterday but my phone has since been stuck in a boot loop a factory reset has not worked either where do I stand"},{"text":"Hello, I'm having problems with my phone. I looked online at the issues I'm having with it and it seems to be a faulty software issue. however, ive had this phone for a while so I'm hoping you can still help."},{"text":"Device is broken"},{"text":"Can there be too many devices on a wireless router?"},{"text":"I have problem in my handset"},{"text":"I have slow connection"},{"text":"My battery runs down too fast"},{"text":"My mobile data isn't working"},{"text":"Phone line fault"},{"text":"Testing an issue"},{"text":"What is the support for galaxy s4?"},{"text":"What's wrong with my iphone? it has lower signal strength than my samsung even when next to each other?"},{"text":"Yep tried not working"},{"text":"Yes lets do troubleshooting first"}],"description":"Request help for a device or service issue."},{"intent":"Telco_Device_Upgrade_Eligibility","examples":[{"text":"What's the waiting period until my next upgrade?"},{"text":"What are my upgrade options?"},{"text":"Upgrading early if possible as its stopped working"},{"text":"Please inform me when I can change my device again"},{"text":"I would like to upgrade"},{"text":"I want to change my device?"},{"text":"How I can upgrade my phone for the latest model?"},{"text":"Do I have the requirements for upgrade?"},{"text":"When to upgrade?"},{"text":"When can I get a new phone?"},{"text":"What year will I be eligible for an upgrade?"},{"text":"What is my eligibility for an upgrade?"},{"text":"Help me change my phone"},{"text":"Give me a new phone"},{"text":"I need to know on what date updating my phone be conducted?"},{"text":"Hoping I could get a new phone?"},{"text":"Am I due an upgrade at the moment?"},{"text":"And to be clear here, as a jump customer, I can upgrade all my lines, as long as they're jump eligible? correct? online?"},{"text":"Are there any free upgrades available on my account?"},{"text":"Does my contract allows me to make an upgrade now or should I wait until the contract ends?"}],"description":"Inquire about when, if, or how a device can be upgraded."},{"intent":"TEST","examples":[{"text":"ibm functions test"},{"text":"test for sandbox"},{"text":"testing WA"},{"text":"test"},{"text":"this is a test"}],"description":""},{"intent":"eCommerce_Payment_Due_Date","examples":[{"text":"When will be my next day of payment?"},{"text":"Can you remind me when is my payment due day?"},{"text":"Could you pls advise on due date of my bill?"},{"text":"Date of payment"},{"text":"How can I check when my monthly payment is due?"},{"text":"I need to know the due date for my phone bill"},{"text":"Is there any grace period with due dates?"},{"text":"I wonder what is my payment date?"},{"text":"I would like to know the due date of my bill"},{"text":"Next billing due"},{"text":"On what day is my cellphone payment due?"},{"text":"Statement due"},{"text":"What day do I have to make my payment by?"},{"text":"When due?"},{"text":"When is my current amount due?"},{"text":"When is my current bill pay date?"},{"text":"When is my payment due by?"},{"text":"When is the day for paying the bils?"},{"text":"When is the next payment date?"},{"text":"Which is the deadline for the settlement of my bills?"}],"description":"Inquire about when the next payment is due."},{"intent":"ticket-info","examples":[{"text":"some info on these tickets"},{"text":"can you give me some info on above tickets"},{"text":"can you give me some more information on these tickets"}],"description":""},{"intent":"Telco_Roaming_Inquiry","examples":[{"text":"Will I get service on my prepaid phone in another country?"},{"text":"Roaming question"},{"text":"Tell me the roaming costs for morocco"},{"text":"What about roaming?"},{"text":"What are the different international roaming packages avaialble?"},{"text":"What data plans are available when I travel out of the country?"},{"text":"What does it cost to surf in cuba?"},{"text":"What is the best rate plan for me given that I am travelling to the following countries in the next 3 months (germany india thailand)?"},{"text":"What options are there for phone use in canada?"},{"text":"Which service providers can I roam with?"},{"text":"Will my prepaid device work if I go to mexico?"},{"text":"I want to check my roaming status"},{"text":"I'm going to bermuda and want to know my charges"},{"text":"How much does it cost to roam?"},{"text":"How does roaming work and how does it affect me?"},{"text":"Hi I m going to france tomorrow"},{"text":"Do I have free data and texting when traveling to the uk?"},{"text":"Coverage abroad"},{"text":"Can you please give me rates for roaming?"},{"text":"Can I use my phone in india?"}],"description":"Inquire about using a phone outside of the home country."},{"intent":"Telco_Add_Insurance","examples":[{"text":"What types of phone insurance are available?"},{"text":"What is about the insurance coverage?"},{"text":"What are the options for insurance?"},{"text":"Want to check on insurance"},{"text":"This phone comes with insurance? how do I know? do I need to pay extra fee?"},{"text":"I would like to purchase coverage for my phone."},{"text":"I what to add an insurance."},{"text":"I want my phone to be insured."},{"text":"Insurance please"},{"text":"How much am I going to be charged monthly if I add an insurance of my phone?"},{"text":"I need to add insurance"},{"text":"I forgot to ask for insurance when I bought my phone last week."},{"text":"I'd like to get insurance"},{"text":"How to insure?"},{"text":"How do I buy insurance?"},{"text":"How does insurance work?"},{"text":"Do I have security coverage in my account?"},{"text":"Can I put insurance back on cell phones after 30 days?"},{"text":"Add a protection plan."},{"text":"Will I need insurance if I rent from you?"}],"description":"Add insurance coverage to an account."},{"intent":"eCommerce_Modify_Product_Order","examples":[{"text":"I want to update my order."},{"text":"How do I change the phone that I ordered?"},{"text":"I'd like to change some things with my most recent order"},{"text":"I would like to add additional items to an order."},{"text":"I need to amend the order I placed yesterday please"},{"text":"Can you help me modify the order that I just placed?"},{"text":"Changed mind on last order"},{"text":"Hey I would like to change the delivery date on my order please"},{"text":"I need to change my order help please"},{"text":"I need to make a change to my current order"},{"text":"I ordered a new phone today but forgot to add an extra charger. can you please add it to my original order."},{"text":"Is there a way to modify a previous order?"},{"text":"I want to change my last order but I don't want to cancel it. can I do that?"},{"text":"I want to edit an order"},{"text":"I want to modify an order made"},{"text":"Can I change my order for a new device?"},{"text":"How can I chance my order?"},{"text":"Can you change the order I just placed?"},{"text":"Can I change the number on the order from three to four?"},{"text":"I would like to modify an order I made."}],"description":"Change or modify a placed order."},{"intent":"eCommerce_Make_A_Payment","examples":[{"text":"I'd like to pay"},{"text":"I also want to make a payment when I have you here on chat"},{"text":"Bugger me I wanna pay me bill"},{"text":"Can I do a bill payment?"},{"text":"Can I pay my bill?"},{"text":"Right now, I am in a different city and how to make cash payment as today is the due date"},{"text":"Schedule payment"},{"text":"Want to pay"},{"text":"Can you assist me with paying my bill?"},{"text":"Handle payment?"},{"text":"How can I pay off my balance?"},{"text":"Request bill pay"},{"text":"Pay my account"},{"text":"I would like to ask a question about making a payment."},{"text":"I want to pay my bill with a credit card"},{"text":"I want to make payment"},{"text":"I want to make a one time payment and enter my debit card payment information"},{"text":"I think I'm gonna pay the bill"},{"text":"I need to schedule a payment"},{"text":"I need to pay the cost of my service plan"}],"description":"Make a payment."},{"intent":"Telco_Network_Unlock","examples":[{"text":"How do I unlock a new prepaid phone that I just purchased?"},{"text":"How do I unlock my account on my pay as you go cell phone?"},{"text":"How to unlock a prepaid sim card for nokia lumina 520?"},{"text":"I have a locked phone that I need unlocked."},{"text":"I have a new phone and want to unlock it"},{"text":"Can you help access my device please?"},{"text":"Your store would not unlock it for me and told me to complete the online form"},{"text":"Why is my new phone still locked?"},{"text":"What is the amount of time it takes to unlock a device?"},{"text":"What is my puk?"},{"text":"We're trying to unlock my daughter's phone it's taking too long. help?"},{"text":"Want to unlock device from a service network"},{"text":"Puk code"},{"text":"My number was transferred to another provider at my request and now I find I cannot obtain an unlock code for my phone which incidentally I purchased myself"},{"text":"I want my phone to not be locked."},{"text":"How do I get my phone unlocked?"},{"text":"I've done the online form thing but that can take upto 10 days is there someone who can unlock it now"},{"text":"How do I get assistance unlocking my new pay as you go phone?"},{"text":"Hi I need an nuc please"},{"text":"Can you explain how to unlock a gflex please?"}],"description":"Unlock a device from a specific service network."},{"intent":"Telco_Remove_Service_Features","examples":[{"text":"I want to remove call blocking from my plan."},{"text":"I want to remove the tethering and hot-spot services from my account"},{"text":"I would like to delete conference calling from my plan. can you help me do this please?"},{"text":"Please can you remove roaming from my plan."},{"text":"What features can I remove?"},{"text":"Can I please remove some of my month to month services?"},{"text":"Can I remove a new feature to my plan?"},{"text":"Can I remove tethering please?"},{"text":"Can I update my plan to remove text messaging?"},{"text":"Can you help me remove the call blocking feature form my plan?"},{"text":"Hey can you remove the roaming feature from my phone please"},{"text":"How can I remove hot-spot feature?"},{"text":"How do I cancel my international calling feature?"},{"text":"How do I remove roaming?"},{"text":"How to disable voicemail?"},{"text":"I need to remove mms on my phone."},{"text":"I recently signed up for a new plan but found I don't really use most of the options. could you please remove everything except regular calls and text messaging."},{"text":"I want to cancel mms from my plan and reduce the payment."},{"text":"I want to delete message feature"},{"text":"I want to remove some features"}],"description":"Remove service features from a plan."},{"intent":"ticket-id","examples":[],"description":""},{"intent":"Telco_Coverage_Area_Inquiry","examples":[{"text":"How large is the coverage area?"},{"text":"How can I find out if your company provides a coverage in my area?"},{"text":"Hey guys, I don't suppose a mere single subscriber could convince you to improve add at all coverage to jefferson valley, ny?"},{"text":"Why is there no cell phone coverage working in tracy, ca?"},{"text":"I want to know which areas in florida have 3 g services"},{"text":"Network coverage"},{"text":"Next week I will be going to hawaii. will I have reception there?"},{"text":"Nothing to help me there. again, any plans to improve new orleans coverage soon? I live here."},{"text":"Show me the map"},{"text":"Tell me if there is service on the east coast"},{"text":"What areas do you support?"},{"text":"What carrier has the best coverage on the metro north train line?"},{"text":"What is my network coverage?"},{"text":"Where can I get the best reception locally?"},{"text":"Where will my phone receive the best covereage?"},{"text":"Is there service in northern california?"},{"text":"Is there phone reception in the adirondacks?"},{"text":"I'm planning on stopping in a wireless store today to check it out. 1 big? is coverage. have a map/look avail?"},{"text":"I'm moving to dallas, will my phone work there?"},{"text":"I'm not getting any signal at school, is it outside of your coverage area?"}],"description":"Inquire about network coverage."},{"intent":"eCommerce_Dispute","examples":[{"text":"What are the items on my bill?"},{"text":"Can you change my bill?"},{"text":"Can you help me understand my bill?"},{"text":"Explain phone bill"},{"text":"How to get a bill corrected?"},{"text":"I'd like credit for interrupted service."},{"text":"I don't agree with the charge"},{"text":"I'm not at all pleased with your data speed and I don't feel like I'm getting my money's worth. so I'd like an adjustment"},{"text":"I need to readjust my credit card, I am getting endless late fee's despite paying on the due date, I want answers."},{"text":"I need to request an adjustment on my billing statement."},{"text":"I noticed on my bill that I get charged every month for an extra line. I do not have an extra line. can you please check?"},{"text":"Need explanation for the settlement of loan against credit card"},{"text":"Please check the output for my last credit card transaction"},{"text":"What do I do if my bill is wrong?"},{"text":"What is the $5.00 charge related to?"},{"text":"What's a 'restoral fee' and why did you charge me $50.00 for it?"},{"text":"Why is there an increase in this months bill from last month?"},{"text":"Why late fee?"},{"text":"Why was I charged an administration fee?"},{"text":"Why was I charged multiple times for the same purchase?"}],"description":"Dispute an issue about a bill."},{"intent":"eCommerce_Create_Product_Order","examples":[{"text":"Where I can order?"},{"text":"Place order for device"},{"text":"Purchase something new"},{"text":"What are the methods to place an order?"},{"text":"Where to buy a camera?"},{"text":"Buy accessories"},{"text":"Can I order some products?"},{"text":"Can you tell me which phones are on sale this week? I want to buy a new phone?"},{"text":"Help me to create a new order"},{"text":"How do I go about placing an order with you?"},{"text":"I am ready to order now."},{"text":"I need a new cell phone"},{"text":"I need jeans"},{"text":"I need some assistance in purchasing a pre paid mobile phone as well as a sim"},{"text":"I want to reorder"},{"text":"I would like a sim"},{"text":"I would like to purchase a new device for cash"},{"text":"Make the order again"},{"text":"Ok order this for me"},{"text":"Order and payment for device"}],"description":"Place an order."},{"intent":"Severity","examples":[{"text":"how many tickets are marked as low"},{"text":"How many high Severity tickets are there?"},{"text":"High Severity tickets"},{"text":"how many trouble tickets are of high severity"}],"description":""},{"intent":"eCommerce_Method_Of_Payment","examples":[{"text":"What did I pay for credit card?"},{"text":"Change payment setup"},{"text":"Direct transfer"},{"text":"Do you accept bank wires?"},{"text":"Do you accept visa?"},{"text":"Do you take discover?"},{"text":"Hi, can I pay for the service by paypal?"},{"text":"How can I pay you?"},{"text":"I need to add a new payment card"},{"text":"I need to change my credit card"},{"text":"Is there a chance I can pay with cash upon delivery?"},{"text":"I want to change my payment preferences."},{"text":"I want to switch what card my payment is taken from"},{"text":"Morning, can you tell me by what methods I can settle my monthly bill?"},{"text":"Pay by email"},{"text":"Till now, I was paying in cash. may I pay the future payments through credit card?"},{"text":"Update card"},{"text":"What are the payment methods?"},{"text":"What are your payment options?"},{"text":"What kind of payments are accepted?"}],"description":"Manage the method of payment for a bill."},{"intent":"Telco_Port_In","examples":[{"text":"How do I transfer my service?"},{"text":"I'd like to retain the same phone number if I change service providers"},{"text":"Is it possible for me to switch services and still keep the same phone number?"},{"text":"I wanna port"},{"text":"I want to port in a phone"},{"text":"I want to switch my service provider but number should be same. how can I do this?"},{"text":"Need the pac code from my contract"},{"text":"Porting inquiry"},{"text":"Tell me if I'll lose my number if I switch service providers"},{"text":"What do I need to do to keep my sme phone number if I switch?"},{"text":"What is the procedure on how to switch from another carrrier and keeping the my number?"},{"text":"Bring my number to your service"},{"text":"Can I keep my number now that I am switching to a burner phone?"},{"text":"Can I kindly ask you instead of copying and pasting lengthy messages how to transfer my old number to you?"},{"text":"Can I switch my service provider without losing my number?"},{"text":"Can I transfer my phone number when I start?"},{"text":"Can I use my number from before?"},{"text":"Do I have to change my number or can I keep my own?"},{"text":"Give me new pac codes"},{"text":"How do I bring in my number?"}],"description":"Transfer a phone number from another service provider."},{"intent":"Telco_Network_Complaints","examples":[{"text":"I am having a lot of call dropouts"},{"text":"Won't receive cell calls"},{"text":"Why there's so many areas where I don't have reception?"},{"text":"Why do I keep losing reception?"},{"text":"Why does my call drop every time I drive to work?"},{"text":"Why can't I get good service in norwalk, ct?"},{"text":"What can I do about dropped calls?"},{"text":"My data network signal goes on and off every few hours please open a ticket"},{"text":"I would like to know why I cannot receive calls today in the city where I currently live."},{"text":"Is there bad network in my area?"},{"text":"Is there a network issue in my area?"},{"text":"I need help getting on the network"},{"text":"I have poor reception in my house"},{"text":"I haven't got a signal"},{"text":"I have a problem with coverage. can you help?"},{"text":"I don't know why but my phone doesn't work at home"},{"text":"I don't have signal on my cell"},{"text":"I can use my phone apps but not make calls."},{"text":"I am not getting reception in certain areas. are there areas where my service provider does not provide coverage?"},{"text":"Can't access the network"}],"description":"Inquire about network issues."},{"intent":"Telco_Deactivate_Prepaid_Plan","examples":[{"text":"Cancel prepaid phone"},{"text":"What do I need to do to get my pre-paid phone deactivated?"},{"text":"Stop service on my prepaid line"},{"text":"Please help me to cancel my prepaid device."},{"text":"May you help to desactivate my prepaid device?."},{"text":"It's possible deactivate my prepaid phone device?"},{"text":"Is online deactivation available for prepaid phone?"},{"text":"I don't want to use my current prepaid phone anymore"},{"text":"How long does it take for a pre-paid device to stop operating?"},{"text":"How do I go about deactivating my pay as you go device?"},{"text":"How can my new prepaid phone be turned off?"},{"text":"How can I shut down my prepaid phone?"},{"text":"Do they deactivate pay and go phones at stores?"},{"text":"De-activate prepaid plan"},{"text":"Could you show me how to shut down my pay as you go device?"},{"text":"Can you tell me how long it typically takes to cancel my prepaid device?"},{"text":"Can you please help me stop using my as you go phone?"},{"text":"Can you help me deactivate my prepaid device?"},{"text":"Can I disable my prepaid phone?"},{"text":"Can I deactivate my prepaid phone?"}],"description":"Deactivate a prepaid plan."},{"intent":"thanks","examples":[{"text":"nice talking to you"},{"text":"thank you"},{"text":"thanks"},{"text":"thanks for your help"}],"description":""},{"intent":"eCommerce_Cancel_Product_Order","examples":[{"text":"I just placed and order, but I need to cancel it."},{"text":"I wish to cancel my recent order"},{"text":"Please cancel the order I've made this morning"},{"text":"How can I cancel my order of your extended data service?"},{"text":"Can you help me to cancel the order which I just placed a few minutes ago?"},{"text":"Can you help me to cancel my last order?"},{"text":"Please cancel the order that was recently placed."},{"text":"I need to speak to someone about an order I made not long ago, I need to cancel it please"},{"text":"I recently placed an order for a new phone online. I've changed my mind. can you please cancel my order?"},{"text":"I've bought an keyboard and id like to cancel it"},{"text":"I want to cancel the new device switch order I placed"},{"text":"I want to cancel the order"},{"text":"I need to cancel an order that I placed."},{"text":"I made an order yesterday, can I cancel it?"},{"text":"I wish to cancel my last order."},{"text":"How can I cancel my previous order?"},{"text":"Cancel existing order"},{"text":"Cancel order placed earlier"},{"text":"Cancel order submitted today"},{"text":"I need to cancel the most recent order. how do I do this?"}],"description":"Cancel an order."},{"intent":"Usage","examples":[{"text":"can you show me my overall usage?"},{"text":"can you just show me my overall usage?"},{"text":"It's more than I expected, can you just show me my overall usage?"},{"text":"why is it so much, show me my usage?"}],"description":""},{"intent":"Telco_Swap_Device","examples":[{"text":"Can you swap sim card on iphone?"},{"text":"How can I switch from an device to another one?"},{"text":"How can I switch my plan to a new phone?"},{"text":"How do I activate my new phone and disconnect the old one?"},{"text":"How to copy contacts from android to iphone?"},{"text":"I am trying to swap two devices but I can't figure out what to do"},{"text":"Can I switch my device?"},{"text":"Who do I contact to change my contract from my old phone to my new phone?"},{"text":"Will my text messages come over to my new phone when I migrate to it?"},{"text":"Will you tell me how to change to the new phone?"},{"text":"Yo, what do I do to switch the service from my old phone to my new one"},{"text":"I just got my iphone at your store but my old one is the only one working."},{"text":"I just purchased a new phone. can you guide me through the steps to switch my service to it?"},{"text":"I need to switch to a new device and I need you to activate it after deactivating my current one."},{"text":"I want to swap"},{"text":"I would like to transfer service across to my new handset please"},{"text":"Move phone"},{"text":"My new phone came in the mail - what do I do now?"},{"text":"Rt where can I find them? I got a new iphone and I want to transfer them from my old iphone to my new one."},{"text":"Sim swap time"}],"description":"Change device."},{"intent":"ticketdetails","examples":[{"text":"can you give some details on those high severity tickets"},{"text":"Need details about high severity trouble tickets"},{"text":"Need details about low severity trouble tickets"},{"text":"can you give some details on those low severity tickets"}],"description":""},{"intent":"eCommerce_Statements","examples":[{"text":"How can I save statements of credit card?"},{"text":"Can I check my bill?"},{"text":"Can I get another copy of my bill?"},{"text":"Can I request credit card statement right from this chat window?"},{"text":"Could you please send a print out of my late statement?"},{"text":"Help me find my bill"},{"text":"How do I get a previous month's bill?"},{"text":"How do I view my e-bill?"},{"text":"I need to know more about my paper statements that I receive at home"},{"text":"I seem to have misplaced my most recent billing statement and would appreciate if you sent me a replacement one."},{"text":"Is there any sort of extra fee for paper invoices?"},{"text":"I wanna see my bill"},{"text":"I want a copy of the bill from last month"},{"text":"I want a physical copy of credit card history"},{"text":"I want to request a credit card statement"},{"text":"My bank statement shows an unexpected payment to you so I would like a copy of my latest billing statement."},{"text":"Show my bill"},{"text":"What are my bills details?"},{"text":"What are the steps for checking credit card statement for particular duration?"},{"text":"What was my last bill?"}],"description":"Request a billing statement."},{"intent":"eCommerce_Defer_Payment","examples":[{"text":"Bill extension"},{"text":"Can I ask for a payment deferment?"},{"text":"Can I defer a bill please?"},{"text":"Can I defer the balance on my account?"},{"text":"Can I delay a payment for a couple of days?"},{"text":"Please keep power on I can pay you later"},{"text":"Can I pay my bill later than due date?"},{"text":"Can you get payment extension?"},{"text":"Could the due date for my next bill be delayed? I have changed jobs and my old company did not yet pay me?"},{"text":"Hi. my payment due date is't convenient for me. could I change it?"},{"text":"How can avoid late fees?"},{"text":"How can I extent the due date of my payments?"},{"text":"How can I postpone making a payment?"},{"text":"I am not able to pay my bill this week. can you please extend the bill due date by 1 week"},{"text":"I can't pay my bill on time, can I pay it the week after it's due?"},{"text":"I'd like to delay this month's payment by a week please."},{"text":"I need to defer my bill payment by 7 days."},{"text":"Is there any way that I can defer a payment for my phone? I will be on vacation and won't be able to do it from overseas?"},{"text":"I would like to extend my payment due date"},{"text":"Payment after due date"}],"description":"Delay the payment due date for a current bill."},{"intent":"eCommerce_Balance_Inquiry","examples":[{"text":"Current bill amount"},{"text":"Yes, I want to check my balance"},{"text":"What was my account balance as of june 1st, 2016?"},{"text":"What's my balance?"},{"text":"What is the remaining balance?"},{"text":"What is my full balance?"},{"text":"What is my current outstanding?"},{"text":"Show balance"},{"text":"I would like to check how much my bill is please thank you"},{"text":"I want to ask about my account balance"},{"text":"I'd like to find out how much I owe"},{"text":"How much is my next payment?"},{"text":"Hello. I want to know how much I have to pay this month"},{"text":"Give me the amount due"},{"text":"Can I check my data balance?"},{"text":"Can I see my account balance?"},{"text":"Can you assist me to check my balance?"},{"text":"Can you help me check my balance?"},{"text":"Can you tell me how much my bill is for this month, I think it is going to be expensive?"},{"text":"Can you tell me my current balance please?"}],"description":"Inquire about an account balance."},{"intent":"Telco_Activate_Prepaid_Plan","examples":[{"text":"May you help me to my pay and go device?"},{"text":"How to activate prepaid product?"},{"text":"I have prepaid service and need to know how long it takes for it to become activated"},{"text":"I'm finding it difficult to activate my prepaid phone. is there a step by step guide anywhere?"},{"text":"I want to setup up my prepaid device"},{"text":"Just got a new prepaid phone, can you get it activated for me?"},{"text":"Can you tell me when my phone will be activated?"},{"text":"Could you kindly activate my phone?"},{"text":"Could you show me how to activate my prepaid device please?"},{"text":"Hey I would like to activate my prepaid phone please"},{"text":"How can I activated my prepaid device?"},{"text":"How can I activate my new prepaid phone at the local store?"},{"text":"How do I add a used prepaid phone to my account that I purchased?"},{"text":"How do I setup my pre paid service?"},{"text":"How do I turn on the prepaid phone service?"},{"text":"How long will it take for my prepaid phone to activate?"},{"text":"When will my new phone be activated?"},{"text":"What's the best way to remove the restriction and activate a new pay as you go mobile?"},{"text":"What do I need to do to activate my prepaid mobile?"},{"text":"Using my pre paid device"}],"description":"Activate a prepaid plan."},{"intent":"Telco_Change_Price_Plan","examples":[{"text":"I want info on how to change my plan to a new offer"},{"text":"Can I buy extra data and keep my same plan?"},{"text":"Can I change my basic plan through this number?"},{"text":"How can I go back to my old plan?"},{"text":"How can I improve my internet speeds?"},{"text":"How do I change my price plan to pay as you go?"},{"text":"What are the costs to upgrade my plan and the applicable charges?"},{"text":"Unlimited data please"},{"text":"Tell me about changing the price plan for me!"},{"text":"Please help me change my service"},{"text":"I want to change to a new plan, how much more would that cost"},{"text":"Is there a cheaper contract?"},{"text":"Is there a better plan for me?"},{"text":"I need to change the current plan my phone"},{"text":"I need to change my service"},{"text":"I need help with switch my service"},{"text":"Increase service"},{"text":"I'd like to switch my service"},{"text":"I'd like to pay less for my service"},{"text":"How hard is it to change data plans?"}],"description":"Inquire about changing a plan."},{"intent":"eCommerce_Recurring_Payment_Autopay","examples":[{"text":"Can you help me cancel the autopay?"},{"text":"Can I change my plan to auto pay?"},{"text":"Automatically pay bills"},{"text":"Auto bill pay"},{"text":"How do I set up direct debit?"},{"text":"How can I change my recurring payment?"},{"text":"Hi, how can I set up the automated monthly payments?"},{"text":"Do you offer automatic payment set-up?"},{"text":"Can I make a payment now and have it be recurring?"},{"text":"Manage autopay"},{"text":"I would like to set up monthly payments"},{"text":"I would like to change the account my automatic payment is drawn from please?"},{"text":"I want to know how to set up automatic payments"},{"text":"I want to activate auto payments"},{"text":"I need to make changes to my automatic payments for my account."},{"text":"I'd like to setup autopay please."},{"text":"How to cancel my card automated payments?"},{"text":"How do I turn auto pay on?"},{"text":"How do I sign up for autopay?"},{"text":"How do I sign up for auto on line bill payment?"}],"description":"Start making automatic recurring payments."},{"intent":"TroubleTickets","examples":[{"text":"need info about tt"},{"text":"Trouble Tickets"},{"text":"I want to discuss a trouble ticket"},{"text":"I want to query about trouble tickets"},{"text":"tickets"}],"description":""},{"intent":"eCommerce_Refund_Payment","examples":[{"text":"Arrange refund"},{"text":"If I cancel some services which have been prepaid, can I receive a refund for part of what has already been paid? what is your refund policy?"},{"text":"I paid my bill twice last month. can you refund my last payment?"},{"text":"Is it possible to refund the latest payment that I made?"},{"text":"I was charged for services that I don't subscribe to. how can I go about getting a refund"},{"text":"Can I get a refund on the activation fee?"},{"text":"Can I get a refund when my internet was out for 6 hours?"},{"text":"Can I get my last month refunded due to the contract cancelation?"},{"text":"Can I just have a full refund?"},{"text":"Can you refund all payments?"},{"text":"Who do I have to speak to get a refund on one of my payments?"},{"text":"Where can I get refunds?"},{"text":"Refund my payment"},{"text":"My service was interrupted for 5 days. I would like a refund based on the time that the service was unavailable."},{"text":"Do I get a refund if I paid too much?"},{"text":"I am unfairly charged. am I going to be refunded?"},{"text":"I want a refund on the previous purchase I made."},{"text":"I was overcharged on my last bill, I need that refunded."},{"text":"My credit card was double charged for my last bill. how do I get the extra charge refunded to it?"},{"text":"I would like a refund for the service outage last month please."}],"description":"Request a refund for a payment."},{"intent":"Salutation","examples":[{"text":"what's up"},{"text":"hey"},{"text":"hi there"},{"text":"hello"},{"text":"hi"}],"description":""},{"intent":"Telco_Return_Device","examples":[{"text":"Do you take returns for upgrading to a new phone?"},{"text":"Having a problem w/ ph just bought - how to return if pre-pd?"},{"text":"Hi I ve recently had a new phone but I don't like it I m happy to stay with the contract is it possible to go back to using my old phone"},{"text":"Am I still able to return my device even though it's been two months?"},{"text":"Can I return my phone to upgrade it?"},{"text":"Can I send you my device?"},{"text":"Do I need to return the remotes?"},{"text":"How do I return a broken phone?"},{"text":"How do I return something?"},{"text":"How long do I have to return the phone if I change my mind?"},{"text":"I bought my phone last week and I'm thinking about returning it"},{"text":"I just missed the return deadline by a day, is there anything I can do about this?"},{"text":"I want to send my mobile back can you help me"},{"text":"I want to upgrade to the latest phone can I return the one I have now."},{"text":"Return policy"},{"text":"Tom what are the policies on returning a device that was used for one week?"},{"text":"Where in fairfax va can I return a router back to you?"},{"text":"Where to return my cable boxes?"},{"text":"Why won't your store accept my return?"},{"text":"I bought a new cell phone two weeks ago and the reception is very bad. could you please tell me if I am within the covered period to return or exchange."}],"description":"Inquire about returning unwanted devices."},{"intent":"Telco_Add_Service_Features","examples":[{"text":"I want to add call display. can you help me?"},{"text":"I would like help adding voicemail to account."},{"text":"What are services you can add?"},{"text":"Lately, every incoming call I get from out-of-state is a telemarketer. how do I block all out-of-state calls?"},{"text":"Do I have call forwarding?"},{"text":"Could I get more space in my voicemail box?"},{"text":"Can you re-instate the extra calling features that I used last summer?"},{"text":"I would like to add features"},{"text":"What is the tracking service?"},{"text":"Can I request a hot-spot service for the next month?"},{"text":"Can I add a ringback tone?"},{"text":"Add something to existing plan."},{"text":"Add call waiting"},{"text":"Hi I d like to enable wifi calling"},{"text":"How can I active the international usage on my line?"},{"text":"How can I enable gps service for a non-smart phone in my account?"},{"text":"How do I add a feature?"},{"text":"How do I add tethering to my phone?"},{"text":"How much is it going to cost to add text messaging to my current plan?"},{"text":"I wanna block a number"}],"description":"Add new service features."}],"entities":[{"entity":"severity","values":[{"type":"synonyms","value":"low","synonyms":["low","lower"]},{"type":"synonyms","value":"high","synonyms":[]}]},{"entity":"sys-person","values":[]},{"entity":"id","values":[{"type":"patterns","value":"id","patterns":["^[a-fA-F\\d]{24}$"]}],"fuzzy_match":false},{"entity":"sys-number","values":[]}],"language":"en","metadata":{"api_version":{"major_version":"v1","minor_version":"2018-07-10"}},"description":"","dialog_nodes":[{"type":"standard","output":{"text":{"values":["$ticket"],"selection_policy":"sequential"}},"parent":"node_1_1534437507082","metadata":{},"conditions":"true","dialog_node":"node_4_1534441636811"},{"type":"standard","output":{"text":{"values":["Your top voice charges for this month are as below:"],"selection_policy":"sequential"}},"parent":"node_10_1535035505050","actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/getBillingEvents","type":"server","credentials":"$private.my_credentials","result_variable":"result"}],"context":{"summary":"from-watson-table"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"condition","dialog_node":"node_13_1535037423390"},"conditions":"#Telco_Troubleshooting","dialog_node":"node_12_1535035643059"},{"type":"standard","output":{"text":{"values":["The number of @severity severity tickets are $count.count"],"selection_policy":"sequential"}},"parent":"node_1_1524770709794","metadata":{},"conditions":"true","dialog_node":"node_1_1525117196240"},{"type":"standard","output":{},"parent":"node_2_1524684386614","actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/TT_Severity","type":"server","parameters":{"severity":"@severity"},"credentials":"$private.my_credentials","result_variable":"severityNumber"}],"metadata":{},"conditions":"@severity","dialog_node":"node_3_1524691788642"},{"type":"standard","output":{"text":{"values":["Your Overall Usage for Voice, Data and SMS is as below:"],"selection_policy":"sequential"}},"parent":"node_7_1535035273453","actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/getUsageReport","type":"server","parameters":{"severity":"@severity"},"credentials":"$private.my_credentials","result_variable":"result"}],"context":{"summary":"from-watson-table"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"condition","dialog_node":"node_10_1535035505050"},"conditions":"#Usage","dialog_node":"node_9_1535035481163"},{"type":"standard","output":{"text":{"values":["$result"],"selection_policy":"sequential"}},"parent":"node_9_1535035481163","metadata":{},"conditions":"true","dialog_node":"node_10_1535035505050"},{"type":"standard","output":{"text":{"values":["Please Provide id of the trouble ticket you are looking for?"],"selection_policy":"sequential"}},"parent":"node_4_1534176303618","context":{"summary":"from-watson"},"metadata":{},"conditions":"#ticket-info","dialog_node":"node_1_1534436676755"},{"type":"standard","output":{"text":{"values":["$result"],"selection_policy":"sequential"}},"parent":"node_12_1535035643059","metadata":{},"conditions":"true","dialog_node":"node_13_1535037423390"},{"type":"standard","output":{"text":{"values":["Your current balance is $$balance.accountbal from $balance.startdatetime to $balance.enddatetime."],"selection_policy":"sequential"}},"parent":"node_1_1524526499632","metadata":{},"conditions":"true","dialog_node":"node_7_1535035273453"},{"type":"standard","output":{"text":{"values":[""],"selection_policy":"sequential"}},"parent":"node_1_1534436676755","actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/GetTroubleTicket","type":"server","parameters":{"id":"@id.literal"},"credentials":"$private.my_credentials","result_variable":"ticket"}],"context":{"summary":"from-watson"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"body","dialog_node":"node_4_1534441636811"},"conditions":"@id","dialog_node":"node_1_1534437507082"},{"type":"standard","output":{"text":{"values":["Sure, let me connect to a human agent"],"selection_policy":"sequential"}},"parent":"node_13_1535037423390","context":{"summary":"from-watson"},"metadata":{},"conditions":"#Telco_International_Rate_Plan_Inquiry","dialog_node":"node_15_1535037561712"},{"type":"standard","output":{"text":{"values":["$tickets"],"selection_policy":"sequential"}},"parent":"node_1_1534174015968","metadata":{},"conditions":"true","dialog_node":"node_4_1534176303618"},{"type":"standard","output":{"text":{"values":["Welcome to the TM Forum bot"],"selection_policy":"sequential"}},"context":{"summary":"from-watson"},"metadata":{},"conditions":"#Salutation","dialog_node":"node_2_1524532532848","previous_sibling":"Welcome"},{"type":"standard","output":{"text":{"values":[""],"selection_policy":"sequential"}},"actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/TT_Details","type":"server","parameters":{"severity":"@severity"},"credentials":"$private.my_credentials","result_variable":"tickets"}],"context":{"summary":"from-watson-table"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"body","dialog_node":"node_4_1534176303618"},"conditions":"#ticketdetails","digress_in":"does_not_return","dialog_node":"node_1_1534174015968","previous_sibling":"node_1_1524770709794"},{"type":"standard","output":{"text":{"values":[""],"selection_policy":"sequential"}},"actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/TT_Severity","type":"server","parameters":{"severity":"@severity"},"credentials":"$private.my_credentials","result_variable":"count"}],"context":{"summary":"from-watson"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"condition","dialog_node":"node_1_1525117196240"},"conditions":"#Severity","dialog_node":"node_1_1524770709794","previous_sibling":"node_2_1524684386614"},{"type":"standard","title":"Anything else","output":{"text":{"values":["I didn't understand. You can try rephrasing.","Can you reword your statement? I'm not understanding.","I didn't get your meaning."],"selection_policy":"sequential"}},"metadata":{},"conditions":"anything_else","dialog_node":"Anything else","previous_sibling":"node_5_1533929305439"},{"type":"standard","output":{"text":{"values":["What exactly would you like to know"],"selection_policy":"sequential"}},"metadata":{},"conditions":"#TroubleTickets","dialog_node":"node_2_1524684386614","previous_sibling":"node_1_1524526499632"},{"type":"standard","output":{"text":{"values":[""],"selection_policy":"sequential"}},"actions":[{"name":"/saisrinivas.gorti@ibm.com_dev/TMForumLabs/getAccountInfo","type":"server","credentials":"$private.my_credentials","result_variable":"balance"}],"context":{"summary":"from-watson"},"metadata":{},"next_step":{"behavior":"jump_to","selector":"body","dialog_node":"node_7_1535035273453"},"conditions":"#eCommerce_Balance_Inquiry","dialog_node":"node_1_1524526499632","previous_sibling":"node_2_1524532532848"},{"type":"standard","output":{"text":{"values":["It was nice helping you, Have a good day. Thank you !!!"],"selection_policy":"sequential"}},"metadata":{},"conditions":"#thanks","dialog_node":"node_5_1533929305439","previous_sibling":"node_1_1534174015968"},{"type":"standard","title":"Welcome","output":{"text":{"values":["Hello. How can I help you?"],"selection_policy":"sequential"}},"metadata":{},"conditions":"welcome","dialog_node":"Welcome"}],"workspace_id":"88a9b9b7-9e3b-4bbd-a2d3-0757108aa558","counterexamples":[],"learning_opt_out":false}